k_tau_paper/channel/openFoam_fine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 0.1;

vertices
(
    (-0.4 0 0.1)
    (0.4 0 0.1)
    (0.4 0 -0.1)
    (-0.4 0 -0.1)
    (-0.4 1 0.1)
    (0.4 1 0.1)
    (0.4 1 -0.1)
    (-0.4 1 -0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4 1 52) simpleGrading (1 1 0.005)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (7 4 5 6)
        );
    }
    syms
    {
        type symmetryPlane;
        faces
        (
            (3 2 1 0)            
        );
    }
    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces           ((0 4 7 3));
    }
    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces           ((2 6 5 1));
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);


// ************************************************************************* //
